app/Models/SalesscreenModel.php

    public function getProduct(){
        return $this->db
            ->table('tbl_items')
            ->get()
            ->getResult();
---
SELECT *
FROM `tbl_items`

    public function getItemDataById($id){
        return $this->db->table('tbl_sales_item')
        ->where('ref_id',$id)
        ->get()
        ->getResult();
---
SELECT *
FROM `tbl_sales_item`
WHERE `ref_id` = '35'

    public function getSettings(){
        return $this->db
        ->table('tbl_settings')
        ->get()
        ->getRow();
---
SELECT *
FROM `tbl_settings`